SchroedingersMer/stm32-/Hardware/time.c
#include "stm32f10x.h"                
#include "Show.h"
#include "Ultrasound.h"

uint8_t temp;

void Time_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);			
																	
	TIM_InternalClockConfig(TIM1);		
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;				
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;     
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up; 
	TIM_TimeBaseInitStructure.TIM_Period = 10000 - 1;                 
	TIM_TimeBaseInitStructure.TIM_Prescaler = 7200 - 1;               
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;           
	TIM_TimeBaseInit(TIM1, &TIM_TimeBaseInitStructure);             
	TIM_ClearFlag(TIM1, TIM_FLAG_Update);
    
  TIM_ITConfig(TIM1, TIM_IT_Update, ENABLE);
	
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = TIM1_UP_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_Init(&NVIC_InitStructure);
    
	TIM_Cmd(TIM1, ENABLE);	
}

void TIM1_UP_IRQHandler(void)
{
	sec++;
	if(sec>=60){sec = 0;min++;if(min>=99)min = 0;}
	temp = 1;
	TIM_ClearITPendingBit(TIM1, TIM_IT_Update);
}
